student_schedule = {
    "Первая неделя": {
        "Понедельник": {
            "2023-09-04": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Вводный курс по специальности",
                    "Преподаватель": "Олькова А.Е., Гусева А.А.",
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": None,
                },
            },
        },
        "Вторник": {
            "2023-09-05": {
                "Пара 1": {
                    "Время": None,
                    "Предмет": "Вводный курс по специальности",
                    "Преподаватель": None,
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": "lms.ranepa.ru",
                },
            },
        },
        "Среда": {
            "2023-09-06": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Вводный курс по специальности",
                    "Преподаватель": "Олькова А.Е., Гусева А.А.",
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": None,
                },
            },
        },
        "Четверг": {
            "2023-09-07": {
                "Пара 1": {
                    "Время": None,
                    "Предмет": "Вводный курс по специальности",
                    "Преподаватель": None,
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": "lms.ranepa.ru",
                },
            },
        },
        "Пятница": {
            "2023-09-08": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Вводный курс по специальности",
                    "Преподаватель": "Олькова А.Е., Гусева А.А.",
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": None,
                },
            },
        },
        "Суббота": {
            "2023-09-09": {
                "Пара 1": {
                    "Время": None,
                    "Предмет": "Вводный курс по специальности",
                    "Преподаватель": None,
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": "lms.ranepa.ru",
                },
            },
        },
    },
    "Вторая неделя": {
        "Понедельник": {
            "2023-09-11": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Вручение документов (очно в академии)",
                    "Преподаватель": None,
                    "Формат обучения": None,
                    "Дополнительная информация": "Тестирование по английскому языку (устное собеседование)",
                },
            },
        },
        "Вторник": {
            "2023-09-12": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Философия бизнеса",
                    "Преподаватель": "Загарин И.А.",
                    "Формат обучения": "в академии",
                    "Дополнительная информация": "Ауд. 213",
                },
            },
        },
        "Среда": {
            "2023-09-13": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Управленческая экономика",
                    "Преподаватель": "Макарова О.Ю.",
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": None,
                },
            },
        },
        "Четверг": {
            "2023-09-14": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Современные коммуникации в бизнесе (английский язык)",
                    "Преподаватель": None,
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": "Группа 1 - перевод, Группа 4",
                },
            },
        },
        "Пятница": {
            "2023-09-15": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Иностранный (испанский) язык как средство деловой коммуникации (факультатив)",
                    "Преподаватель": "Львова Е.В.",
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": None,
                },
            },
        },
        "Суббота": {
            "2023-09-16": {
                "Пара 1": {
                    "Время": "9:30-12:10",
                    "Предмет": "Современный менеджмент",
                    "Преподаватель": "Ицаков Е.Д.",
                    "Формат обучения": "в академии",
                    "Дополнительная информация": "Ауд. 3432-1к",
                },
                "Пара 2": {
                    "Время": "12:30-15:10",
                    "Предмет": "Вводный курс по специальности",
                    "Преподаватель": "Олькова А.Е., Гусева А.А.",
                    "Формат обучения": "в академии",
                    "Дополнительная информация": "Ауд. 3432-1к",
                },
            },
        },
    },
    "Третья неделя": {
        "Понедельник": {
            "2023-09-17": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Современные коммуникации в бизнесе (английский язык)",
                    "Преподаватель": None,
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": "Группа 1 - перевод, Группа 2, Группа 3, Группа 4",
                },
            },
        },
        "Вторник": {
            "2023-09-26": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Философия бизнеса",
                    "Преподаватель": "Загарин И.А.",
                    "Формат обучения": "в академии",
                    "Дополнительная информация": "Ауд. 213",
                },
            },
        },
        "Среда": {
            "2023-09-27": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Управленческая экономика",
                    "Преподаватель": "Макарова О.Ю.",
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": None,
                },
            },
        },
        "Четверг": {
            "2023-09-28": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Современные коммуникации в бизнесе (английский язык)",
                    "Преподаватель": None,
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": "Группа 1 - перевод, Группа 4",
                },
            },
        },
        "Пятница": {
            "2023-09-29": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Иностранный (испанский) язык как средство деловой коммуникации (факультатив)",
                    "Преподаватель": "Львова Е.В.",
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": None,
                },
            },
        },
        "Суббота": {
            "2023-09-30": {
                "Пара 1": {
                    "Время": "9:30-12:10",
                    "Предмет": "Современный менеджмент",
                    "Преподаватель": "Ицаков Е.Д.",
                    "Формат обучения": "в академии",
                    "Дополнительная информация": "Ауд. 3432-1к",
                },
                "Пара 2": {
                    "Время": "12:30-15:10",
                    "Предмет": "Математические методы в экономике",
                    "Преподаватель": "Овсянникова С.Н.",
                    "Формат обучения": "в академии",
                    "Дополнительная информация": "Ауд. 3432-1к",
                },
            },
        },
    },
    "Четвертая неделя": {
        "Понедельник": {
            "2023-10-02": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Современные коммуникации в бизнесе (английский язык)",
                    "Преподаватель": "Группа 1 - перевод, Группа 2, Группа 3, Группа 4",
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": None,
                },
            },
        },
        "Вторник": {
            "2023-10-03": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Философия бизнеса",
                    "Преподаватель": "Загарин И.А.",
                    "Формат обучения": "в академии",
                    "Дополнительная информация": "Ауд. 213",
                },
            },
        },
        "Среда": {
            "2023-10-04": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Управленческая экономика",
                    "Преподаватель": "Макарова О.Ю.",
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": None,
                },
            },
        },
        "Четверг": {
            "2023-10-05": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Современные коммуникации в бизнесе (английский язык)",
                    "Преподаватель": "Группа 1 - перевод, Группа 4",
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": None,
                },
            },
        },
        "Пятница": {
            "2023-10-06": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Иностранный (испанский) язык как средство деловой коммуникации (факультатив)",
                    "Преподаватель": "Львова Е.В.",
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": None,
                },
            },
        },
        "Суббота": {
            "2023-10-07": {
                "Пара 1": {
                    "Время": "9:30-12:10",
                    "Предмет": "Современный менеджмент",
                    "Преподаватель": "Ицаков Е.Д.",
                    "Формат обучения": "в академии",
                    "Дополнительная информация": "Ауд. 3432-1к",
                },
                "Пара 2": {
                    "Время": "12:30-15:10",
                    "Предмет": "Математические методы в экономике",
                    "Преподаватель": "Овсянникова С.Н.",
                    "Формат обучения": "в академии",
                    "Дополнительная информация": "Ауд. 3432-1к",
                },
            },
        },
    },
    "Пятая неделя": {
        "Понедельник": {
            "2023-10-09": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Современные коммуникации в бизнесе (английский язык)",
                    "Преподаватель": "Группа 1 - перевод, Группа 2, Группа 3, Группа 4",
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": None,
                },
            },
        },
        "Вторник": {
            "2023-10-10": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Философия бизнеса",
                    "Преподаватель": "Загарин И.А.",
                    "Формат обучения": "в академии",
                    "Дополнительная информация": "Ауд. 213",
                },
            },
        },
        "Среда": {
            "2023-10-11": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Управленческая экономика",
                    "Преподаватель": "Макарова О.Ю.",
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": None,
                },
            },
        },
        "Четверг": {
            "2023-10-12": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Современные коммуникации в бизнесе (английский язык)",
                    "Преподаватель": "Группа 1 - перевод, Группа 4",
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": None,
                },
            },
        },
        "Пятница": {
            "2023-10-13": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Иностранный (испанский) язык как средство деловой коммуникации (факультатив)",
                    "Преподаватель": "Львова Е.В.",
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": None,
                },
            },
        },
        "Суббота": {
            "2023-10-14": {
                "Пара 1": {
                    "Время": "9:30-12:10",
                    "Предмет": "Современный менеджмент",
                    "Преподаватель": "Ицаков Е.Д.",
                    "Формат обучения": "в академии",
                    "Дополнительная информация": "Ауд. 3432-1к",
                },
                "Пара 2": {
                    "Время": "12:30-15:10",
                    "Предмет": "Математические методы в экономике",
                    "Преподаватель": "Овсянникова С.Н.",
                    "Формат обучения": "в академии",
                    "Дополнительная информация": "Ауд. 3432-1к",
                },
            },
        },
    },
    "Шестая неделя": {
        "Понедельник": {
            "2023-10-16": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Современные коммуникации в бизнесе (английский язык)",
                    "Преподаватель": "Группа 1 - перевод, Группа 2, Группа 3, Группа 4",
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": None,
                },
            },
        },
        "Вторник": {
            "2023-10-17": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Философия бизнеса",
                    "Преподаватель": "Загарин И.А.",
                    "Формат обучения": "в академии",
                    "Дополнительная информация": "Ауд. 213",
                },
                "Пара 2": {
                    "Время": "19:00-21:30",
                    "Предмет": "Зачет",
                    "Преподаватель": None,
                    "Формат обучения": "в академии",
                    "Дополнительная информация": None,
                },
            },
        },
        "Среда": {
            "2023-10-18": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Стратегический менеджмент и стратегический анализ",
                    "Преподаватель": "Ицаков Е.Д.",
                    "Формат обучения": "в академии",
                    "Дополнительная информация": None,
                },
            },
        },
        "Четверг": {
            "2023-10-19": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Современные коммуникации в бизнесе (английский язык)",
                    "Преподаватель": "Группа 1 - перевод, Группа 4",
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": None,
                },
            },
        },
        "Пятница": {
            "2023-10-20": {
                "Пара 1": {
                    "Время": "19:00-21:30",
                    "Предмет": "Иностранный (испанский) язык как средство деловой коммуникации (факультатив)",
                    "Преподаватель": "Львова Е.В.",
                    "Формат обучения": "Онлайн",
                    "Дополнительная информация": None,
                },
            },
        },
        "Суббота": {
            "2023-10-21": {
                "Пара 1": {
                    "Время": "9:30-12:10",
                    "Предмет": "Финансовый менеджмент и корпоративные финансы",
                    "Преподаватель": "Дворецкая А.Е.",
                    "Формат обучения": "в академии",
                    "Дополнительная информация": "Ауд. 3432-1к",
                },
                "Пара 2": {
                    "Время": "12:30-15:10",
                    "Предмет": "Финансовый менеджмент и корпоративные финансы",
                    "Преподаватель": "Дворецкая А.Е.",
                    "Формат обучения": "в академии",
                    "Дополнительная информация": "Ауд. 3432-1к",
                },
            },
        },
    },
}
